'use strict';

Какое будет выведено значение: let x = 5; alert( x++ ); ? //5

Чему равно такое выражение: [ ] + false - null + true ? //Nan
console.log([] + false - null); //false []- заменяется на пустую строку -null(NaN) +true(nan)

Что выведет этот код: let y = 1; let x = y = 2; alert(x); ? //2

Чему равна сумма [] + 1 + 2? // '12'

Что выведет этот код: alert( "1"[0] )? // 1 

Чему равно 2 && 1 && null && 0 && undefined ? // null - &&- запинается на лжи

Есть ли разница между выражениями? !!( a && b ) и (a && b)? //не равны. !!-два значка не превращает в булиновое

Что выведет этот код: alert( null || 2 && 3 || 4 ); // и выполняется первее чем или
                                   3    3    3

a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ? // нет, разные хранилища которые равны значениями

Что выведет этот код: alert( +"Infinity" ); ? // infinity 

Верно ли сравнение: "Ёжик" > "яблоко"? //нет посмотреть символы юникод

Чему равно 0 || "" || 2 || undefined || true || falsе ?  //2